Revit 2024 API
BuiltInFailures.SiteFailures.SurfaceSelfIntersection Property
 The splitting boundary drawn would result in a self-intersection of the surface boundary. Please edit your splitting lines to correct the problem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SurfaceSelfIntersection { get; }
Visual Basic
Public Shared ReadOnly Property SurfaceSelfIntersection As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SurfaceSelfIntersection {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace